---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.IsDone
source: html/d4063441-cb33-a8b2-da0a-1c6d10503557.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizeSettingIterator.IsDone Method

Identifies if the iteration has completed.

## Syntax (C#)
```csharp
public virtual bool IsDone()
```

## Returns
True if the iteration has no more items. False if there are more items to be iterated.